# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2  320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4   160
   [-1, 3, C3, [128]],     #160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8  80
   [-1, 6, C3, [256]],  #80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16  40
   [-1, 9, C3, [512]],   #40
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32  20
   [-1, 3, C3, [1024]],  #20
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[4, 1, Conv, [64, 1, 1]],
  [6, 1, Conv, [128, 1, 1]],
  [9, 1, Conv, [256, 1, 1]],

  [10, 1, Conv, [64, 1, 1]],
  [11, 1, Conv, [128, 1, 1]],
  [12, 1, Conv, [256, 1, 1]],

  [[13, 14], 1, ASFF_2, [64, 0]],
  [[13, 14], 1, ASFF_2, [128, 1]],

  [16, 1, BasicBlock, [64]],
  [17, 1, BasicBlock, [128]],

  [[18, 19, 15], 1, ASFF_3, [64, 0]],
  [[18, 19, 15], 1, ASFF_3, [128, 1]],
  [[18, 19, 15], 1, ASFF_3, [256, 2]],

  [20, 1, BasicBlock, [64]],
  [21, 1, BasicBlock, [128]],
  [22, 1, BasicBlock, [256]],

  [23, 1, Conv, [256, 1, 1]],
  [24, 1, Conv, [512, 1, 1]],
  [25, 1, Conv, [1024, 1, 1]],
  [[26, 27, 28], 1, Detect, [nc, anchors]],
  ]
